# Project 3 - IMDB Movies

Anjali Prakash


## Load File and Imports

In [2]:
import pandas as pd 
import numpy as np

In [3]:
# making new folder with os
import os
os.makedirs('Data/',exist_ok=True) # Confirm folder created
os.listdir("Data/")

['.DS_Store',
 'final_tmdb_data_.csv.gz',
 'title.ratings.csv.gz',
 'tmdb_api_results_2000.json',
 'final_tmdb_data_2000.csv.gz',
 'tmdb_api_results_2001.json',
 'final_tmdb_data_2001.csv',
 'title.basics.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 '.ipynb_checkpoints',
 'final_tmdb_data_.csv',
 'title.akas.csv.gz']

In [4]:
basics_url="https://datasets.imdbws.com/title.basics.tsv.gz"
ratings_url = 'https://datasets.imdbws.com/title.ratings.tsv.gz'
akas_url = "https://datasets.imdbws.com/title.akas.tsv.gz"

In [5]:
basics = pd.read_csv(basics_url, sep='\t', low_memory=False)

In [6]:
ratings = pd.read_csv(ratings_url, sep='\t', low_memory=False)

In [ ]:
akas = pd.read_csv(akas_url, sep= '\t', low_memory=False)

##  Pre-processing steps

In [ ]:
basics.shape

In [ ]:
ratings.shape

In [ ]:
akas.shape

In [ ]:
## elimate regions other than the US
akas_us = akas.loc[akas['region'] == 'US']

In [ ]:
akas_us.head()

In [ ]:
## replace '\n' values with 'NaN'
akas_us = akas_us.replace({'\\N':np.nan})

In [ ]:
akas_us.head()

In [ ]:
## only keep films that also exist in akas_us table
keepers =basics['tconst'].isin(akas_us['titleId'])
keepers

In [ ]:
basics = basics[keepers]
basics

In [ ]:
## replace null values with 'NaN'
basics = basics.replace({'\\N':np.nan})

In [ ]:
basics.head()

In [ ]:
## eliminate null values from runtimeMinutes column
basics = basics[basics['runtimeMinutes'].notna()]

In [ ]:
## eliminate null values from genres column
basics = basics[basics['genres'].notna()]

In [ ]:
## only keep titles that are 'movies'
basics = basics.loc[basics['titleType'] == 'movie']

In [ ]:
## change startYear to a float dtype
basics['startYear'] = basics['startYear'].astype('float')

In [ ]:
basics.dtypes

In [ ]:
## only keep films that started between 2000-2021
basics = basics[(basics['startYear'] >=2000)&(basics['startYear'] <2022)]

In [ ]:
# Exclude movies that are included in the documentary category.
is_documentary = basics['genres'].str.contains('documentary',case=False)
basics = basics[~is_documentary]

In [ ]:
## only include films in ratings table that also exist in 'akas_us' table
keepers =ratings['tconst'].isin(akas_us['titleId'])
keepers

In [ ]:
ratings = ratings[keepers]
ratings

In [ ]:
ratings = ratings.replace({'\\N':np.nan})

In [ ]:
## preview of ratings table
ratings.info

In [ ]:
## preview of basics table 
basics.info

In [ ]:
## preview of akas_us table
akas_us.info

In [ ]:
## Save current dataframe to file.
basics.to_csv("Data/title.basics.csv.gz",compression='gzip',index=False)

In [ ]:
# Open saved file and preview again
basics = pd.read_csv("Data/title.basics.csv.gz", low_memory = False)
basics.head()

In [ ]:
## Save current dataframe to file.
ratings.to_csv("Data/title.ratings.csv.gz",compression='gzip',index=False)

In [ ]:
# Open saved file and preview again
ratings = pd.read_csv("Data/title.ratings.csv.gz", low_memory = False)
ratings.head()

In [ ]:
## Save current dataframe to file.
akas_us.to_csv("Data/title.akas.csv.gz",compression='gzip',index=False)

In [ ]:
# Open saved file and preview again
akas_us = pd.read_csv("Data/title.akas.csv.gz", low_memory = False)
akas_us.head()

## Part 2

In [ ]:
import json
with open('/Users/anjali_work/.secret/tmdb_api.json', 'r') as f:
    login = json.load(f)
## Display the keys of the loaded dict
login.keys()

In [ ]:
import tmdbsimple as tmdb
tmdb.API_KEY =  login['api-key']

In [ ]:
def get_movie_with_rating(movie_id):
    # Get the movie object for the current id
    movie = tmdb.Movies(movie_id)
    # save the .info .releases dictionaries
    info = movie.info()
    releases = movie.releases()
    # Loop through countries in releases
    for c in releases['countries']:
    # if the country abbreviation==US
        if c['iso_3166_1' ] =='US':
        ## save a "certification" key in the info dict with the certification
           info['certification'] = c['certification']
            
    return info

In [ ]:
test = get_movie_with_rating("tt0848228") #put your function name here
test

In [ ]:
## testing our function by looping through a list of ids
import pandas as pd
test_ids = ["tt0848228", "tt0115937","tt0848228","tt0332280"]
results = []
for movie_id in test_ids:
    
    try:
        movie_info = get_movie_with_rating(movie_id)
        results.append(movie_info)
        
    except: 
        pass
    
pd.DataFrame(results)

In [ ]:
## testing our function by looping through a list of ids
import pandas as pd
test_ids = ["tt0848228", "tt0115937","tt0848228","tt0332280"]
results = []
errors = []
for movie_id in test_ids:
    
    try:
        movie_info = get_movie_with_rating(movie_id)
        results.append(movie_info)
        
    except Exception as e: 
        errors.append([movie_id, e])
    
pd.DataFrame(results)

In [ ]:
print(f"- Number of errors: {len(errors)}")
errors

In [ ]:
import os, time,json
import tmdbsimple as tmdb 
from tqdm.notebook import tqdm_notebook 

FOLDER = "Data/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)

In [ ]:
def write_json(new_data, filename): 
    """Appends a list of records (new_data) to a json file (filename). 
    Adapted from: https://www.geeksforgeeks.org/append-to-json-file-using-python/"""  
    
    with open(filename,'r+') as file:
        # First we load existing data into a dict.
        file_data = json.load(file)
        ## Choose extend or append
        if (type(new_data) == list) & (type(file_data) == list):
            file_data.extend(new_data)
        else:
             file_data.append(new_data)
        # Sets file's current position at offset.
        file.seek(0)
        # convert back to json.
        json.dump(file_data, file)
        

def read_and_fix_json(JSON_FILE):
    """Attempts to read in json file of records and fixes the final character
    to end with a ] if it errors.
    
    Args:
        JSON_FILE (str): filepath of JSON file
        
    Returns:
        DataFrame: the corrected data from the bad json file
    """
    try: 
        previous_df =  pd.read_json(JSON_FILE)
    
    ## If read_json throws an error
    except:
        
        ## manually open the json file
        with open(JSON_FILE,'r+') as f:
            ## Read in the file as a STRING
            bad_json = f.read()
            
            ## if the final character doesn't match first, select the right bracket
            first_char = bad_json[0]
            final_brackets = {'[':']', 
                           "{":"}"}
            ## Select expected final brakcet
            final_char = final_brackets[first_char]
            
            ## if the last character in file doen't match the first char, add it
            if bad_json[-1] != final_char:
                good_json = bad_json[:-1]
                good_json+=final_char
            else:
                raise Exception('ERROR is not due to mismatched final bracket.')
            
            ## Rewind to start of file and write new good_json to disk
            f.seek(0)
            f.write(good_json)
           
        ## Load the json file again now that its fixed
        previous_df =  pd.read_json(JSON_FILE)
        
    return previous_df

In [ ]:
# Load in the dataframe from project part 1 as basics:
basics = pd.read_csv('Data/title.basics.csv.gz')

In [ ]:
YEARS_TO_GET = [2000,2001]

In [ ]:
errors = [ ]

In [ ]:
# Start of OUTER loop
for YEAR in tqdm_notebook(YEARS_TO_GET, desc='YEARS', position=0):
    #Defining the JSON file to store results for year
    JSON_FILE = f'{FOLDER}tmdb_api_results_{YEAR}.json'
    # Check if file exists
    file_exists = os.path.isfile(JSON_FILE)
    
    # If it does not exist: create it
    if file_exists == False:
    # save an empty dict with just "imdb_id" to the new json file.
        with open(JSON_FILE,'w') as f:
            json.dump([{'imdb_id':0}],f)
    
    #Saving new year as the current df
    df = basics.loc[ basics['startYear']==YEAR].copy()
    # saving movie ids to list
    movie_ids = df['tconst'].copy()
    
    # Load existing data from json into a dataframe called "previous_df"
    previous_df = pd.read_json(JSON_FILE)
    
    
    # filter out any ids that are already in the JSON_FILE
    movie_ids_to_get = movie_ids[~movie_ids.isin(previous_df['imdb_id'])]
      #Get index and movie id from list

       #Get index and movie id from list
    # INNER Loop
    for movie_id in tqdm_notebook(movie_ids_to_get,
                                  desc=f'Movies from {YEAR}',
                                  position=1,
                                  leave=True):
        try:
            # Retrieve then data for the movie id
            temp = get_movie_with_rating(movie_id)  
            # Append/extend results to existing file using a pre-made function
            write_json(temp,JSON_FILE)
            # Short 20 ms sleep to prevent overwhelming server
            time.sleep(0.02)
            
        except Exception as e:
            errors.append([movie_id, e])
            
    final_year_df = pd.read_json(JSON_FILE)
    final_year_df.to_csv(f"{FOLDER}final_tmdb_data_{YEAR}.csv.gz", compression="gzip", index=False)
    
    print(f"- Total errors: {len(errors)}")
    
    # Instead of previous_df=pd.read_json:
    previous_df = read_and_fix_json(JSON_FILE)

In [3]:
df1 = pd.read_csv('data/final_tmdb_data_2000.csv.gz')
df1.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.50,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.45,10.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.00,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.10,2298.0,PG

In [ ]:
df2 = pd.read_csv('data/final_tmdb_data_2001.csv.gz')
df2.head()

In [ ]:
# concatenate the data frames
frames = [df1, df2]

df = pd.concat(frames)

In [ ]:
df.shape

### Exploratory Visualizations

In [ ]:
#importing useful packages
import seaborn as sns

**How many movies had at least some valid financial information (values > 0 for budget OR revenue)?**

In [ ]:
## only keep films that have a budget or revenue > 0
grossing_titles = df[(df['budget'] >0)|(df['revenue'] >0)]

In [ ]:
grossing_titles.shape

644 movies had some valid financial information (value > 0 for budget or revenue)

**How many movies are there in each of the certification categories (G/PG/PG-13/R)?**

In [ ]:
# Histogram for Capital Gain
ax = sns.countplot(data=grossing_titles, x="certification")
#ax.ticklabel_format(style='plain');
ax.tick_params(axis='x', rotation = 45);
ax.set_title("Distribution of Certifications for Movies")
ax.set_xlabel("Budget");

About 40 PG movies, over 200 R movies, ~20 G movies, ~125 PG-13 movies and ~25 NR movies.

**What is the average revenue per certification category?**

In [ ]:
# Histogram for Capital Gain
ax = sns.barplot(data=grossing_titles, x="certification", y = "revenue")
#ax.ticklabel_format(style='plain');
ax.tick_params(axis='x', rotation = 45);
ax.set_title("Average Revenue per Certification")
ax.set_xlabel("Revenue");

**What is the average budget per certification category?**

In [ ]:
# Histogram for Capital Gain
ax = sns.barplot(data=grossing_titles, x="certification", y = "budget")
#ax.ticklabel_format(style='plain');
ax.tick_params(axis='x', rotation = 45);
ax.set_title("Average Budget per Certication")
ax.set_xlabel("Budget");

In [ ]:
df.to_csv(f"tmdb_results_combined.csv.gz", compression="gzip", index=False)

# Part 3

In [141]:
# Load in the dataframe as basics:
import pandas as pd
basics = pd.read_csv('Data/title.basics.csv.gz')

In [142]:
ratings = pd.read_csv('Data/title.ratings.csv.gz')
tmdb_api_results = pd.read_csv('Data/final_tmdb_data_.csv.gz')

In [143]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

In [144]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1990
1  tt0000002            5.8       264
2  tt0000005            6.2      2647
3  tt0000006            5.0       182
4  tt0000007            5.4       829

In [145]:
tmdb_api_results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2603 entries, 0 to 2602
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2603 non-null   object
 1   adult                  2601 non-null   float64
 2   backdrop_path          1445 non-null   object
 3   belongs_to_collection  211 non-null    object
 4   budget                 2601 non-null   float64
 5   genres                 2601 non-null   object
 6   homepage               170 non-null    object
 7   id                     2601 non-null   float64
 8   original_language      2601 non-null   object
 9   original_title         2601 non-null   object
 10  overview               2558 non-null   object
 11  popularity             2601 non-null   float64
 12  poster_path            2361 non-null   object
 13  production_companies   2601 non-null   object
 14  production_countries   2601 non-null   object
 15  release_date           2580 non-null   object
 16  revenue                2601 non-null   float64
 17  runtime                2601 non-null   float64
 18  spoken_languages       2601 non-null   object
 19  status                 2601 non-null   object
 20  tagline                1119 non-null   object
 21  title                  2601 non-null   object
 22  video                  2601 non-null   float64
 23  vote_average           2601 non-null   float64
 24  vote_count             2601 non-null   float64
 25  certification          815 non-null    object
dtypes: float64(9), object(17)
memory usage: 528.9+ KB

In [146]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [147]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
82007,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
82007,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
82007,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
82008,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
82008,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [148]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [149]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [150]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [151]:
## make new integer genre_id and drop string genres

title_genres['Genre_ID'] = title_genres['genres_split'].replace(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [152]:
title_genres.head()

      tconst  Genre_ID
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

### Getting a list of unique genres

In [153]:
genres = pd.DataFrame({'Genre_Name': genre_map.keys(),
                         'Genre_ID':genre_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [154]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [155]:
#removing unnecessary and redundant columns
basics = basics.drop(columns=['genres_split', 'originalTitle', 'isAdult', 'titleType', 'genres']) 
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70
2,tt0068865,Lives of Performers,2016.0,NaN,90
3,tt0069049,The Other Side of the Wind,2018.0,NaN,122
4,tt0088751,The Naked Monster,2005.0,NaN,100

In [156]:
#removing unnecessary and redundant columns
tmdb_api_results = tmdb_api_results.drop(columns=['adult', 'backdrop_path', 'belongs_to_collection', 'genres', 'homepage', 'original_language', 'original_title', 'overview', 'popularity', 'poster_path', 'production_companies', 'production_countries', 'release_date', 'runtime', 'spoken_languages', 'status', 'tagline', 'title', 'video', 'vote_average', 'vote_count', 'id']) 
tmdb_api_results.head()

     imdb_id      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0113026  10000000.0         0.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694    150000.0  14204632.0            PG

### Saving MySQL tables

In [157]:
import json
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
## loading mysql credentials
with open('/Users/anjali_work/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [158]:
## creating connection to database with sqlalchemy
from urllib.parse import quote_plus as urlquote
connection  = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/movies"
engine = create_engine(connection)

In [159]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [160]:
## 
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [161]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

82009

In [162]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [163]:
## 
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [164]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

506411

In [165]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [166]:
tmdb_api_results.dtypes

imdb_id           object
budget           float64
revenue          float64
certification     object
dtype: object

In [178]:
# dropping values = 0 from tmdb_api_results
tmdb_api_results = tmdb_api_results.loc[ tmdb_api_results['imdb_id']!='0']

In [179]:
## 
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = tmdb_api_results['imdb_id'].fillna('').map(len).max()
certification_len = tmdb_api_results['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    'budget':Float(),
    'revenue':Float(), 
    'certification': Text(certification_len+1)}

In [180]:
# Save to sql with dtype and index=False
tmdb_api_results.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

2601

In [181]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [170]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,if_exists='replace',index=False)

25

In [171]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,if_exists='replace',index=False)

153834

In [182]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [184]:
## displaying first 5 rows of 'genres' table
q= '''SELECT *
FROM genres
LIMIT 5;'''
pd.read_sql(q,engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [185]:
## displaying first 5 rows of 'title_basics' table
q= '''SELECT *
FROM title_basics
LIMIT 5;'''
pd.read_sql(q,engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0068865,Lives of Performers,2016.0,None,90
3,tt0069049,The Other Side of the Wind,2018.0,None,122
4,tt0088751,The Naked Monster,2005.0,None,100

In [186]:
## displaying first 5 rows of 'title_genres' table
q= '''SELECT *
FROM title_genres
LIMIT 5;'''
pd.read_sql(q,engine)

      tconst  Genre_ID
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0068865         7

In [187]:
## displaying first 5 rows of 'title_ratings' table
q= '''SELECT *
FROM title_ratings
LIMIT 5;'''
pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1990
1  tt0000002            5.8       264
2  tt0000005            6.2      2647
3  tt0000006            5.0       182
4  tt0000007            5.4       829

In [188]:
## displaying first 5 rows of 'tmdb_data' table
q= '''SELECT *
FROM tmdb_data
LIMIT 5;'''
pd.read_sql(q,engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

In [183]:
## checking if tables created
q= '''SHOW TABLES;'''
pd.read_sql(q,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data